from translation.tokens import Sentence
from translation.rules import RULESET


if __name__ == '__main__':
    test_texts = [
        'Я не довіряю людям.',
        'Я довіряла людям.',
        'Я довірятиму людям.',

        'Я маю коричневого собаку.',
        'Я маю гарного коричневого собаку.',

        'Я маю собаку давно.',
        'Сьогодні гарна погода.',
        'Я виходжу з дому.',

        'Ти маєш собаку? ',
        'Якого кольору халат лікаря?',
        'Як ти почуваєшся?',

        'Я купила.',
        'Смачний пиріг на тарілці.',
        'На тарілці мало пирогів.'
    ]

    test_ground_truth = [
        'я довіряти людина людина',
        'я довіряти був людина людина',
        'я довіряти буде людина людина',

        'я мати собака коричневий',
        'Я мати собака гарний коричневий',

        'я мати собака давно',
        'сьогодні погода добрий',
        'я виходити дім',

        'ти мати собака',
        'лікар халат колір який',
        'ти почувати себе як',

        'Я купити вже',
        'Тарілка пиріг смачний',
        'Тарілка пиріг мало'
    ]

    for text in test_texts:
        sent = Sentence(text)
        RULESET.translate(sent)
        print(sent)
