from translation.tokens import Sentence
from translation.rules import RULESET


if __name__ == '__main__':
    test_texts = [
        'Я не довіряю людям.',
        'Я довіряла людям.',
        'Я довірятиму людям.',
        'Я купила.',
        'Я купуватиму.',
        'Я куплю.',

        'Я маю коричневого собаку.',
        'Я маю гарного коричневого собаку.',

        'Я маю собаку давно.',
        'Сьогодні гарна погода.',
        'Я виходжу з дому.',

        'Ти маєш собаку? ',
        'Якого кольору халат лікаря?',
        'Як ти почуваєшся?',

        'Смачний пиріг на тарілці.',
        'На тарілці мало пирогів.'
    ]

    test_ground_truth = [
        'я довіряти ні людина людина',
        'я довіряти був людина людина',
        'я довіряти буде людина людина',
        'я купити вже',
        'я купувати буде',
        'я купити потім',

        'я мати собака коричневий',
        'я мати собака гарний коричневий',

        'я мати собака давно',
        'сьогодні погода добрий',
        'я виходити дім',

        'ти мати собака',
        'лікар халат колір який',
        'ти почувати себе як',

        'тарілка пиріг смачний',
        'тарілка пиріг мало'
    ]

    #print('ORIGINAL'.ljust(40), end='')
    #print('TRANSLATED'.ljust(40), end='')
    #print('TARGET')
    for text, gt in zip(test_texts, test_ground_truth):
        sent = Sentence(text)
        RULESET.translate(sent)
        print(text.ljust(40), end='')
        print(str(sent).ljust(40), end='')
        print(gt)
        #print(sent.root.text, end=' ')
        #print(sent.root.token.morph)
